console.log(`------------------------Задание №1------------------------`);
// 1. Создайте объект riddles 


console.log(`------------------------Задание №2------------------------`);
// 2. Добавьте свойства question, answer


console.log(`------------------------Задание №3------------------------`);
// 3. создайте метод askQuestion который спрашивает у пользователя вопрос question и сравнивает ответ с answer


console.log(`------------------------Задание №4------------------------`);
// 4. Добавьте свойство hints (содержащее 2 подсказки)


console.log(`------------------------Задание №5------------------------`);
// 5. Если пользователь ответил неверно, ему даётся одна подсказка


console.log(`------------------------Задание №6------------------------`);
// 6. Если пользователь ответил второй раз неверно, даётся вторая подсказка


console.log(`------------------------Задание №7------------------------`);
// 7. Если ответил неверно, то в консоль выводится текст: “вы проиграли”