console.log(`------------------------Задание №1------------------------`);
// 1. Создайте объект с ключами от 1 до 7, в качестве значений содержащий имена дней недели.Выведите на экран “Вторник”


console.log(`------------------------Задание №2------------------------`);
// 2. Создайте объект user с ключами 'name', 'surname', ‘age’. Выведите на экран фамилию, имя и возраст через дефис.


console.log(`------------------------Задание №3------------------------`);
// 3. Добавьте в объект user свойство отчество, которое пользователь должен ввести с клавиатуры


console.log(`------------------------Задание №4------------------------`);
// 4. Удалите свойство surname