// Дан массив const arr = [2, 5, 9, 15, 1, 4];
// Выведите в консоль те элементы массива, которые больше 3-х, но меньше 10.
// Найдите сумму четных чисел от 2 до 100.
// Дан массив const = [2, 5, 9, 3, 1, 4];
// Найдите сумму элементов этого массива.
// С помощью цикла сформируйте строку '-1-2-3-4-5-6-7-8-9-'.
// Дан массив с числами. const = [2, 5, 9, 0, 3, 1, 4]; Запустите цикл, который будет по очереди выводить элементы этого массива в консоль до тех пор, пока не встретится элемент со значением 0. После этого цикл должен завершить свою работу.


